pajacobs-ghub/AVR64EA28-DAQ-MCU-firmware/daq_mcu.c
// [TODO] EEPROM data should start off like the original values above.

void save_registers_to_EEPROM()
{
    for (int i=0; i < NUMREG; i++) {
        eeprom_write_byte(2*i, (uint8_t)(vregister[i] & 0x00ff));
        eeprom_write_byte(2*i+1, (uint8_t)((vregister[i] & 0xff00) >> 8));
    }
}

void restore_registers_from_EEPROM()
{
    for (int i=0; i < NUMREG; i++) {
        vregister[i] = (int16_t)eeprom_read_byte(2*i) | ((int16_t)eeprom_read_byte(2*i+1) << 8);
    }
}

void iopins_init(void)
{
    // UART0
    PORTA.DIRSET = PIN0_bm; // 0.TX
    PORTA.DIRCLR = PIN1_bm; // 0.RX
    //
    // SPI connection to external SRAM chip
    PORTA.DIRSET = PIN7_bm; // Set PA7 to output for SPI CS_A#
    PORTA.OUTSET = PIN7_bm; // CS_A# high
    PORTA.DIRSET = PIN4_bm; // 0.MOSI
    PORTA.DIRSET = PIN6_bm; // 0.SCK
    PORTA.DIRCLR = PIN5_bm; // 0.MISO
    // Reserve PA2 for CS_B#.
    PORTA.DIRSET = PIN2_bm;
    PORTA.OUTSET = PIN2_bm;
    //
    // Use PF0 to indicate ready/busy#.
    release_busy_pin();
    // Use PF1 to indicate event#.
    release_event_pin();
    // Use PA3 to indicate period of sampling.
    PORTA.DIRSET = PIN3_bm;
    sampling_LED_OFF();
    //
    // 12 analog-in pins
    PORTC.DIRCLR = PIN0_bm; // Input for AIN28
    PORTC.DIRCLR = PIN1_bm; // Input for AIN29
    PORTC.DIRCLR = PIN2_bm; // Input for AIN30
    PORTC.DIRCLR = PIN3_bm; // Input for AIN31
    PORTD.DIRCLR = PIN0_bm; // Input for AIN0
    PORTD.DIRCLR = PIN1_bm; // Input for AIN1
    PORTD.DIRCLR = PIN2_bm; // Input for AIN2
    PORTD.DIRCLR = PIN3_bm; // Input for AIN3
    PORTD.DIRCLR = PIN4_bm; // Input for AIN4
    PORTD.DIRCLR = PIN5_bm; // Input for AIN5
    PORTD.DIRCLR = PIN6_bm; // Input for AIN6
    PORTD.DIRCLR = PIN7_bm; // Input for AIN7
    //
    return;
} // end iopins_init()


void adc0_init(void)
{
    // Set up the ADC for low-latency conversion.
    // Once we start conversions, we will likely want to make
    // subsequent conversions quickly.
    ADC0.CTRLA |= ADC_LOWLAT_bm | ADC_ENABLE_bm;
    ADC0.CTRLB = ADC_PRESC_DIV4_gc; // ADC clock frequency 5MHz
    switch (vregister[9]) {
        case 0:
            ADC0.CTRLC = ADC_REFSEL_VDD_gc;
            break;
        case 1:
            ADC0.CTRLC = ADC_REFSEL_1V024_gc;
            break;
        case 2:
            ADC0.CTRLC = ADC_REFSEL_2V048_gc;
            break;
        case 3:
            ADC0.CTRLC = ADC_REFSEL_4V096_gc;
            break;
        case 4:
            ADC0.CTRLC = ADC_REFSEL_2V500_gc;
            break;
        default:
            ADC0.CTRLC = ADC_REFSEL_4V096_gc;
    }
    ADC0.CTRLE = 20; // SAMPDUR of 4 microseconds
    //
    // The number of samples converted in burst mode is 2^^sampnum.
    uint8_t sampnum = (uint8_t)vregister[34];
    if (sampnum > 0x0A) sampnum = 0x0A;
    if (sampnum == 0) {
        ADC0.CTRLF = ADC_SAMPNUM_NONE_gc;
    } else {
        ADC0.CTRLF = ADC_CHOPPING_bm | ADC_FREERUN_bm | sampnum;
    }
    //
    uint8_t gain_gc = ADC_GAIN_1X_gc;
    switch (vregister[8]) {
        case 0:
            gain_gc = ADC_GAIN_1X_gc;
            break;
        case 1:
            gain_gc = ADC_GAIN_2X_gc;
            break;
        case 2:
            gain_gc = ADC_GAIN_4X_gc;
            break;
        case 3:
            gain_gc = ADC_GAIN_8X_gc;
            break;
        case 4:
            gain_gc = ADC_GAIN_16X_gc;
            break;
        default:
            gain_gc = ADC_GAIN_1X_gc;
    }
    ADC0.PGACTRL = gain_gc | ADC_PGABIASSEL_100PCT_gc | ADC_PGAEN_bm;
    while (ADC0.STATUS & ADC_ADCBUSY_bm) { /* wait for settling */ }
} // end adc0_init()

void adc0_close(void)
{
    ADC0.CTRLA &= ~ADC_ENABLE_bm;
}


uint8_t byte_addr_increment(uint8_t n_chan)
{
    // We choose an increment such that wrap-around within the 23LC1024 chip
    // keeps the sample sets aligned.
    switch (n_chan) {
        case 0: return 2;
        case 1: return 2;
        case 2: return 4;
        case 3: return 8;
        case 4: return 8;
        case 5: return 16;
        case 6: return 16;
        case 7: return 16;
        case 8: return 16;
        case 9: return 32;
        case 10: return 32;
        case 11: return 32;
        case 12: return 32;
        default: return 32;
    }
    return 32;
}

uint32_t max_n_samples(void)
{
    uint8_t n_chan = (uint8_t)vregister[1];
    uint8_t byte_addr_incr = byte_addr_increment(n_chan);
    return size_of_SRAM_in_bytes / byte_addr_incr;
}

void sample_channels(void)
// Sample the analog channels periodically and store the data in external SRAM.
//
// For mode=0, we will consider that the trigger event is immediate, at sample 0,
// and the record will stop after a specified number of samples.
// So long as the record does not wrap around, the oldest sample set will start at
// byte address 0.
//
// For mode=1 or 2, we will start sampling into the external SRAM
// for an indefinite number of samples, while waiting for the trigger event.
// Once the trigger event happens, we will continue the record for a specified
// number of samples.  Because we do not keep a record of the number of times
// that the SRAM address wraps around, we just assume that the oldest sample
// starts at the next byte address to be used to store a sample.
//
{
    // Get configuration data from virtual registers.
    uint16_t ticks = (uint16_t)vregister[0];
    uint8_t n_chan = (uint8_t)vregister[1];
    uint8_t mode = (uint8_t)vregister[3];
# define TRIGGER_IMMEDIATE 0
# define TRIGGER_INTERNAL 1
# define TRIGGER_EXTERNAL 2
    uint8_t trigger_chan = (uint8_t)vregister[4];
    int16_t trigger_level = vregister[5];
    uint8_t trigger_slope = (uint8_t)vregister[6];
    //
    uint8_t byte_addr_incr = byte_addr_increment(n_chan);
    uint8_t via_bits;
    if (vregister[7]) {
        via_bits = ADC_VIA_PGA_gc;
    } else {
        via_bits = ADC_VIA_DIRECT_gc;
    }
    uint8_t muxpos_bits[MAXNCHAN], muxneg_bits[MAXNCHAN];
    for (uint8_t ch=0; ch < n_chan; ch++) {
        muxpos_bits[ch] = via_bits | (uint8_t)vregister[10+2*ch];
        muxneg_bits[ch] = via_bits | (uint8_t)vregister[11+2*ch];
    }
    //
    release_event_pin();
    adc0_init();
    // Default to single sample for each conversion.
    uint8_t adc_cmd = ADC_DIFF_bm | ADC_MODE_SINGLE_12BIT_gc | ADC_START_IMMEDIATE_gc;
    if ((uint8_t)vregister[34] > 0) {
        // Burst-mode sampling with scaling, such that we have to only pick up
        // a 16-bit result.  The results are an accumulation of the sample values
        // and will be scaled such that they are 16 times larger than the raw
        // 12-bit sample, even if fewer than 16 samples were accumulated.
        // See Table 31-3 in the data sheet.
        adc_cmd = ADC_DIFF_bm | ADC_MODE_BURST_SCALING_gc | ADC_START_IMMEDIATE_gc;
    }
    next_byte_addr_in_SRAM = 0; // Start afresh, at address 0.
    byte_addr_has_wrapped_around = 0;
    uint8_t post_event = 0;
    uint16_t samples_remaining = (uint16_t)vregister[2];
    did_not_keep_up_during_sampling = 0; // Presume that we will be fast enough.
    timerA0_init(ticks); // period=ticks*0.8us
    timerA0_wait();
    //
    while (samples_remaining > 0) {
        sampling_LED_ON();
        // Following flag will be set to 0 if we finish sampling before timerA0 overflows.
        uint8_t late_flag = 1;
        // Take the analog sample set.
        for (uint8_t ch=0; ch < n_chan; ch++) {
            // Select ADC channel and make the conversion.
            ADC0.MUXPOS = muxpos_bits[ch];
            ADC0.MUXNEG = muxneg_bits[ch];
            ADC0.COMMAND = adc_cmd;
            while (!(ADC0.INTFLAGS & ADC_RESRDY_bm)) { /* wait */ }
            ADC0.COMMAND = ADC_START_STOP_gc;
            res[ch] = (int16_t)ADC0.RESULT; // 16-bit value only
        }
        // Save the sample for later.
        spi0_send_sample_data(res, n_chan, next_byte_addr_in_SRAM);
        // Point to the next available SRAM address.
        next_byte_addr_in_SRAM += byte_addr_incr;
        if (next_byte_addr_in_SRAM >= size_of_SRAM_in_bytes) {
            next_byte_addr_in_SRAM -= size_of_SRAM_in_bytes;
            byte_addr_has_wrapped_around = 1;
        }
        sampling_LED_OFF();
        //
        if (post_event) {
            // Trigger event has happened.
            samples_remaining--;
        } else {
            // We need to decide about trigger event.
            switch (mode) {
            case TRIGGER_IMMEDIATE:
                post_event = 1;
                assert_event_pin();
                break;
            case TRIGGER_INTERNAL: {
                int16_t s = res[trigger_chan];
                if ((trigger_slope == 1 && s >= trigger_level) ||
                    (trigger_slope == 0 && s <= trigger_level)) {
                    post_event = 1;
                    assert_event_pin();
                } }
                break;
            case TRIGGER_EXTERNAL:
                if (read_event_pin() == 0) {
                    post_event = 1;
                }
            } // end switch
        }
        // timerA0_wait(); Expanded this function into the following lines.
        // Wait for timerA0 overflow.
        while (!(TCA0.SINGLE.INTFLAGS & TCA_SINGLE_OVF_bm)) {
            // __builtin_avr_wdr();
            // We have arrived before the timer overflowed for this sample period.
            late_flag = 0;
        }
        // We reset the interrupt flag for the timer but leave the timer ticking
        // so that we have accurate periods.
        TCA0.SINGLE.INTFLAGS |= TCA_SINGLE_OVF_bm;
        // If we arrive late for the timer, for even one sample set, set the global flag.
        if (late_flag) did_not_keep_up_during_sampling = 1;
    } // end while
    timerA0_close();
    adc0_close();
} // end void sample_channels()

