pajacobs-ghub/AVR64EA28-DAQ-MCU-firmware/daq_mcu.c
void sample_channels_once()
{
    // We temporarily override some of the registers to make this happen.
    uint16_t ticks_save = (uint16_t)vregister[0];
    uint8_t mode_save = (uint8_t)vregister[3];
    uint16_t samples_remaining_save = (uint16_t)vregister[2];
    //
    vregister[0] = (uint16_t)200; // Time enough to do a full scan.
    vregister[3] = 0; // Immediate mode.
    vregister[2] = 1; // One sample set.
    sample_channels();
    //
    // Restore register values.
    vregister[0] = ticks_save;
    vregister[3] = mode_save;
    vregister[2] = samples_remaining_save;
    return;
}

#define NSTRBUF1 128
char str_buf1[NSTRBUF1];
#define NSTRBUF2 16
char str_buf2[NSTRBUF2];

uint32_t oldest_byte_addr_in_SRAM()
{
    return (byte_addr_has_wrapped_around) ? next_byte_addr_in_SRAM : 0;
}

char* sample_set_to_str(uint32_t n)
{
    int nchar;
    uint8_t n_chan = (uint8_t)vregister[1];
    // Start with address of oldest sample, then move to selected sample.
    uint32_t addr = oldest_byte_addr_in_SRAM();
    uint8_t byte_addr_incr = byte_addr_increment(n_chan);
    addr += byte_addr_incr * n;
    // Assume that the size of SRAM is a power of two, so that
    // a bit mask can be used for the valid address bits.
    addr &= mask_for_SRAM_addr;
    spi0_fetch_sample_data(res, n_chan, addr);
    nchar = snprintf(str_buf1, NSTRBUF1, "%d", res[0]);
    for (uint8_t i=1; i < n_chan; i++) {
        nchar = snprintf(str_buf2, NSTRBUF2, " %d", res[i]);
        strncat(str_buf1, str_buf2, NSTRBUF2);
    }
    return str_buf1;
}

#define NBYTES 32
uint8_t bytes[NBYTES];

char* mem_dump_to_str(uint32_t addr)
{
    // Write a 32-byte page of SRAM data into the buffer as pairs of hex digits.
    // [TODO] Consider adding a check-sum to this string.
    int nchar;
    spi0_fetch_bytes(bytes, NBYTES, addr);
    nchar = snprintf(str_buf1, NSTRBUF1, "%02x", bytes[0]);
    for (uint8_t i=1; i < NBYTES; i++) {
        nchar = snprintf(str_buf2, NSTRBUF2, "%02x", bytes[i]);
        strncat(str_buf1, str_buf2, NSTRBUF2);
    }
    return str_buf1;
}

void report_values(void)
// Report the previously-collected data to the UART.
// Assume a simple sampling process with immediate event.
{
    uint8_t mode = (uint8_t)vregister[3];
    uint32_t n_sample = (mode == TRIGGER_IMMEDIATE) ? (uint32_t)vregister[2] : max_n_samples();
    int nchar;
    for (uint32_t i = 0; i < n_sample; i++) {
        nchar = snprintf(str_buf, NSTRBUF, "i=%6lu data=%s\n", i, sample_set_to_str(i));
        usart0_putstr(str_buf);
    }
} // end void report_values()


void interpret_command()
{
    char* token_ptr;
    const char * sep_tok = ", ";
    int nchar;
    uint8_t i;
    int16_t v;
    // The following few lines for debug on the end of a TTL-232 cable.
    // nchar = snprintf(str_buf, NSTRBUF, "Command text was: ");
    // usart0_putstr(str_buf);
    // usart0_putstr(cmd_buf); usart0_putch('\n');
    // nchar = snprintf(str_buf, NSTRBUF, "Number of characters in buffer: %u\n", strlen(cmd_buf));
    // usart0_putstr(str_buf);
    switch (cmd_buf[0]) {
        case 'v':
            // Report the version string (see top of source file)
            nchar = snprintf(str_buf, NSTRBUF, "%s ok\n", VERSION_STR);
            usart0_putstr(str_buf);
            break;
        case 'n':
            // Report number of virtual registers.
            nchar = snprintf(str_buf, NSTRBUF, "%u ok\n", NUMREG);
            usart0_putstr(str_buf);
            break;
        case 'Q':
            // Set the reporting mode to allow multi-line responses.
            // This is really only useful when interacting with the AVR
            // through a TTL-232-5V serial cable.
            // The RS484 COMMS-MCU expects single-line responses.
            allow_multiline_response = 1;
            nchar = snprintf(str_buf, NSTRBUF, "Multi-line response mode. ok\n");
            usart0_putstr(str_buf);
            break;
        case 'q':
            // Set the reporting mode to single-line responses.
            // This is the default mode and the one intended for interaction
            // via the RS485 COMMS-MCU.
            allow_multiline_response = 0;
            nchar = snprintf(str_buf, NSTRBUF, "Single-line response mode. ok\n");
            usart0_putstr(str_buf);
            break;
        case 'p':
            // Print all virtual register values.
            // Should not be used via the RS485 COMMS-MCU.
            if (allow_multiline_response) {
                nchar = snprintf(str_buf, NSTRBUF, "Register values:\n");
                usart0_putstr(str_buf);
                for (i=0; i < NUMREG; ++i) {
                    nchar = snprintf(str_buf, NSTRBUF, "reg[%d]=%d   (%s)\n",
                                     i, vregister[i], hint[i]);
                    usart0_putstr(str_buf);
                }
                nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: Too many values to show.\n");
            }
            usart0_putstr(str_buf);
            break;
        case 'r':
            // Report a selected register value.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume register number.
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    v = vregister[i];
                    nchar = snprintf(str_buf, NSTRBUF, "%d ok\n", v);
                } else {
                    nchar = snprintf(str_buf, NSTRBUF, "fail: Invalid register.\n");
                }
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: No register specified.\n");
            }
            usart0_putstr(str_buf);
            break;
        case 's':
            // Set a selected register value.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text; assume register number.
                i = (uint8_t) atoi(token_ptr);
                if (i < NUMREG) {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        // Assume text is value for register.
                        v = (int16_t) atoi(token_ptr);
                        vregister[i] = v;
                        nchar = snprintf(str_buf, NSTRBUF, "reg[%u] %d ok\n", i, v);
                    } else {
                        nchar = snprintf(str_buf, NSTRBUF, "fail: No value given.\n");
                    }
                } else {
                    nchar = snprintf(str_buf, NSTRBUF, "fail: Invalid register.\n");
                }
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: No register specified.\n");
            }
            usart0_putstr(str_buf);
            break;
        case 'R':
            // Read all of the virtual register values from the AVR's EEPROM.
            restore_registers_from_EEPROM();
            nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            usart0_putstr(str_buf);
            break;
        case 'S':
            // Save all of the current values from the virtual registers
            // to the AVR's on-chip EEPROM.
            save_registers_to_EEPROM();
            nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            usart0_putstr(str_buf);
            break;
        case 'F':
            // Set the values of the registers to those values hard-coded
            // into this firmware.  A factory default, so to speak.
            set_registers_to_original_values();
            nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            usart0_putstr(str_buf);
            break;
        case 'g':
            // Start the sampling process.
            // What happens next, and when it happens, depends on the
            // register settings and external signals.
            nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            usart0_putstr(str_buf);
            // The task takes an indefinite time,
            // so let the COMMS_MCU know via busy# pin.
            assert_busy_pin();
            sample_channels();
            release_busy_pin();
            break;
        case 'G':
            // Immediately take many samples and (eventually) report values.
            // Not to be used with the RS485 COMMS-MCU.
            if (allow_multiline_response) {
                nchar = snprintf(str_buf, NSTRBUF, "ok\n");
                usart0_putstr(str_buf);
                // The task takes an indefinite time,
                // so let the COMMS_MCU know via busy# pin.
                assert_busy_pin();
                sample_channels();
                report_values();
                release_busy_pin();
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: Action not available.\n");
                usart0_putstr(str_buf);
            }
            break;
        case 'k':
            // Report the value of the keeping-up flag.
            nchar = snprintf(str_buf, NSTRBUF, "%u ok\n", did_not_keep_up_during_sampling);
            usart0_putstr(str_buf);
            break;
        case 'I':
            // Immediately take a single sample set and report values.
            sample_channels_once();
            nchar = snprintf(str_buf, NSTRBUF, "%s ok\n", sample_set_to_str(0));
            usart0_putstr(str_buf);
            break;
        case 'P':
            // Report the selected sample set for the configured channels.
            // An index of 0 refers to the oldest sample set.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume sample index.
                uint32_t ii = (uint32_t) atol(token_ptr);
                nchar = snprintf(str_buf, NSTRBUF, "%s ok\n", sample_set_to_str(ii));
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: No index given.\n");
            }
            usart0_putstr(str_buf);
            break;
        case 'a': {
            // Report the byte-address in SRAM of the oldest sample set.
            uint32_t addr = oldest_byte_addr_in_SRAM();
            nchar = snprintf(str_buf, NSTRBUF, "%lu ok\n", addr);
            usart0_putstr(str_buf); }
            break;
        case 'b': {
            // Report the number of bytes in SRAM for each sample set.
            uint16_t bincr = byte_addr_increment((uint8_t)vregister[1]);
            nchar = snprintf(str_buf, NSTRBUF, "%u ok\n", bincr);
            usart0_putstr(str_buf); }
            break;
        case 'm':
            // Report the maximum number of sample seta that the SRAM can hold.
            nchar = snprintf(str_buf, NSTRBUF, "%lu ok\n", max_n_samples());
            usart0_putstr(str_buf);
            break;
        case 'T':
            // Report the total number of bytes in the SRAM chips.
            nchar = snprintf(str_buf, NSTRBUF, "%lu ok\n", size_of_SRAM_in_bytes);
            usart0_putstr(str_buf);
            break;
        case 'M':
            // Report the content of a 32-byte 'page' in SRAM,
            // starting at the specified byte address.
            token_ptr = strtok(&cmd_buf[1], sep_tok);
            if (token_ptr) {
                // Found some nonblank text, assume address.
                uint32_t addr = (uint32_t) atol(token_ptr);
                nchar = snprintf(str_buf, NSTRBUF, "%s ok\n", mem_dump_to_str(addr));
            } else {
                nchar = snprintf(str_buf, NSTRBUF, "fail: No address given.\n");
            }
            usart0_putstr(str_buf);
            break;
        case 'N':
            // Report the total number of 32-byte pages in the SRAM chips.
            nchar = snprintf(str_buf, NSTRBUF, "%lu ok\n", size_of_SRAM_in_bytes/32);
            usart0_putstr(str_buf);
            break;
        case 'z':
            // Release the EVENT# line.
            // Presumably this line has been help low following an internal
            // trigger event during the sampling process.
            release_event_pin();
            nchar = snprintf(str_buf, NSTRBUF, "ok\n");
            usart0_putstr(str_buf);
            break;
        case 'h':
        case '?':
            if (!allow_multiline_response) {
                nchar = snprintf(str_buf, NSTRBUF, "In single-line response mode. Q to get multi-line mode. ok\n");
                usart0_putstr(str_buf);
                break;
            }
            nchar = snprintf(str_buf, NSTRBUF, "AVR64EA28 DAQ-MCU commands and registers\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, "\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, "Commands:\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " h or ? print this help message\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " v      report version of firmware\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " Q      Change to multi-line response mode\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " q      Change to single-line response mode\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " n      report number of registers\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " p      report register values\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " r <i>  report value of register i\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " s <i> <j>  set register i to value j\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " R      restore register values from EEPROM\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " S      save register values to EEPROM\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " F      set register values to original values\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " g      go and start sampling (no report)\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " G      go and start sampling, and then report\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " k      report flag did_not_keep_up_during_sampling\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " I      sample channels once and report\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " P <i>  report sample set i (i=0 for oldest data)\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " M <i>  dump SRAM memory from byte address i\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " a      report byte address of oldest data\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " b      report size of a sample set in bytes\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " m      report max number of samples in SRAM\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " T      report total size of SRAM in bytes\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " N      report total number of 32-bit pages in SRAM\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " z      release EVENTn line\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, "\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, "Registers:\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 0  sample period in timer ticks (0.8us ticks)\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 1  number of channels to sample\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 2  number of samples after trigger event\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 3  trigger mode 0=immediate, 1=internal, 2=external\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 4  trigger channel for internal trigger\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 5  trigger level as an 11-bit count, 0-2047\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 6  trigger slope 0=below-level, 1=above-level\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 7  PGA flag for all channels, 0=direct 1=via_PGA\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 8  PGA gain 0=1X, 1=2X, 2=4X, 3=8X, 4=16X\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 9  V_REF 0=VDD, 1=1V024, 2=2V048, 3=4V096, 4=2V500\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 10 CH0+   22 CH6+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 11 CH0-   23 CH6-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 12 CH1+   24 CH7+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 13 CH1-   25 CH7-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 14 CH2+   26 CH8+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 15 CH2-   27 CH8-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 16 CH3+   28 CH9+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 17 CH3-   29 CH9-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 18 CH4+   30 CH10+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 19 CH4-   31 CH10-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 20 CH5+   32 CH11+\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, " 21 CH5-   33 CH11-\n"); usart0_putstr(str_buf);
            nchar = snprintf(str_buf, NSTRBUF, "ok\n"); usart0_putstr(str_buf);
            break;
        default:
            nchar = snprintf(str_buf, NSTRBUF, "fail: Unknown command.\n"); usart0_putstr(str_buf);
    } // end switch
} // end interpret_command())


int main(void)
{
    int ncmd, nchar;
    //
    // Turn off the main clock prescaler so that we run at full 20MHz.
    ccp_write_io((void *) &(CLKCTRL.MCLKCTRLB), (CLKCTRL.MCLKCTRLB & 0xfe));
    CLKCTRL.MCLKTIMEBASE = TIMEBASE_VALUE; // Needed for the ADC
    iopins_init();
    _delay_ms(10); // Let the pins settle, to reduce garbage on the RX pin.
    usart0_init(230400);
    spi0_init();
    restore_registers_from_EEPROM();
    // Flash the Green LED twice to signal that the MCU is ready.
    for (int8_t i=0; i < 2; ++i) {
        sampling_LED_ON();
        _delay_ms(250);
        sampling_LED_OFF();
        _delay_ms(250);
    }
    did_not_keep_up_during_sampling = 0;
    //
    // The basic behaviour is to be forever checking for a text command.
    while (1) {
        // Characters are NOT echoed as they are typed.
        // Backspace deleting is allowed.
        ncmd = usart0_getstr(cmd_buf, NCMDBUF);
        if (ncmd) {
            interpret_command();
        }
    } // never-ending while
    spi0_close();
    usart0_close();
    return 0;
}
